
public class Start {

	// 追加問題：このプロジェクトの迷路生成処理を完成させよ
	// 必須条件 
	//		・実行するたびに迷路の形が変わる
	//		・迷路の形のデータを直打ちしない
	//
	// プロジェクトの現状
	//		道、外周の壁、スタート、ゴールを配置済み
	// 		他はプロジェクトを確認してコードを読んでください。
	//
	// 		ひとまずは実行してどうなるか見てみるのがいいかと思います。
	//
	// 		赤：ゴール
	// 		青：スタート
	// 		白：道
	// 		黒：壁
	//
	// プロジェクトを読んで構造を把握するところも問題のうちになります。
	// 質問は受け付けていますので、お気軽にどうぞ。

	// とても参考になるページ→:https://www5d.biglobe.ne.jp/stssk/maze/make.html
	
	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

		MazeFrame frame = new MazeFrame();

	}

}
